# Command response
RESP_ERR_NONE = 0
RESP_ERR_USR = -100  # 사용자정보교환실패
RESP_ERR_CONNECTION = -101  # 서버접속실패
RESP_ERR_VERSION = -102  # 버전처리실패
RESP_ERR_FIREWALL = -103  # 개인방화벽실패
RESP_ERR_MEMORY = -104  # 메모리보호실패
RESP_ERR_INPUT = -105  # 함수입력값오류
RESP_ERR_SOCKET_CLOSED = -106  # 통신연결종료
RESP_ERR_SISE_OVERFLOW = -200  # 시세조회과부하
RESP_ERR_RQ_STRUCT_FAIL = -201  # 전문작성초기화실패
RESP_ERR_RQ_STRING_FAIL = -202  # 전문작성입력값오류
RESP_ERR_NO_DATA = -203  # 데이터없음
RESP_ERR_OVER_MAX_DATA = -204  # 조회가능한종목수초과
RESP_ERR_DATA_RCV_FAIL = -205  # 데이터수신실패
RESP_ERR_OVER_MAX_FID = -206  # 조회가능한FID수초과
RESP_ERR_REAL_CANCEL = -207  # 실시간해제오류
RESP_ERR_ORD_WRONG_INPUT = -300  # 입력값오류
RESP_ERR_ORD_WRONG_ACCTNO = -301  # 계좌비밀번호없음
RESP_ERR_OTHER_ACC_USE = -302  # 타인계좌사용오류
RESP_ERR_MIS_2BILL_EXC = -303  # 주문가격이20억원을초과
RESP_ERR_MIS_5BILL_EXC = -304  # 주문가격이50억원을초과
RESP_ERR_MIS_1PER_EXC = -305  # 주문수량이총발행주수의1%초과오류
RESP_ERR_MIS_3PER_EXC = -306  # 주문수량이총발행주수의3%초과오류
RESP_ERR_SEND_FAIL = -307  # 주문전송실패
RESP_ERR_ORD_OVERFLOW = -308  # 주문전송과부하
RESP_ERR_MIS_300CNT_EXC = -309  # 주문수량300계약초과
RESP_ERR_MIS_500CNT_EXC = -310  # 주문수량500계약초과
RESP_ERR_ORD_WRONG_ACCTINFO = -340  # 계좌정보없음
RESP_ERR_ORD_SYMCODE_EMPTY = -500  # 종목코드없음
RESP_SERVER_GUBUN_SIMU = 1

# Error source
CAUSE = {
    0: '정상처리',
    -10: '실패',
    -100: '사용자정보교환실패',
    -102: '버전처리실패',
    -103: '개인방화벽실패',
    -104: '메모리보호실패',
    -105: '함수입력값오류',
    -106: '통신연결종료',
    -200: '시세조회과부하',
    -201: '전문작성초기화실패',
    -202: '전문작성입력값오류',
    -203: '데이터없음',
    -204: '조회가능한종목수초과',
    -205: '데이터수신실패',
    -206: '조회가능한FID수초과',
    -207: '실시간해제오류',
    -300: '입력값오류',
    -301: '계좌비밀번호없음',
    -302: '타인계좌사용오류',
    -303: '주문가격이20억원을초과',
    -304: '주문가격이50억원을초과',
    -305: '주문수량이총발행주수의1%초과오류',
    -306: '주문수량이총발행주수의3%초과오류',
    -307: '주문전송실패',
    -308: '주문전송과부하',
    -309: '주문수량300계약초과',
    -310: '주문수량500계약초과',
    -340: '계좌정보없음',
    -500: '종목코드없음'
}

# logger error sources
Err_login = 'E0001'
Err_call = 'E0002'
Err_tr = 'E0003'
Err_kwcomm = 'E0004'
Err_stocklist = 'E0005'

# Input arguments
ARG_LOGIN_SERVER_GUBUN = 'GetServerGubun'  # 접속서버 구분을 반환합니다.(1: 모의투자, 나머지: 실서버)
ARG_LOGIN_ACCOUNT_CNT = 'ACCOUNT_CNT'  # 보유계좌 수를 반환합니다.
ARG_LOGIN_ACCLIST = 'ACCLIST'  # 구분자 ';' 로 연결된 보유계좌 목록을 반환합니다.
ARG_LOGIN_USR_ID = "USER_ID"  # 사용자 ID를 반환합니다.
ARG_LOGIN_USR_NAME = "USER_NAME"  # 사용자 이름을 반환합니다.
ARG_LOGIN_KEY_SAFETY = "KEY_BSECGB"  # 키보드 보안 해지여부를 반환합니다.(0: 정상, 1: 해지)
ARG_LOGIN_FIREWALL = "FIREW_SECGB"  # 방화벽 설정여부를 반환합니다.(0: 미설정, 1: 설정, 2: 해지)

# Command list
COM_LOGIN = 'CommConnect()'
COM_LOGOUT = 'CommTerminate()'
COM_LOGIN_INFO = 'GetLoginInfo(QString)'
COM_SEND_ORDER = 'SendOrder(QString, QString, QString, int, QString, int, int, QString, QString)'
COM_GET_CODELIST = 'GetCodeListByMarket(QString)'
COM_GET_CODENAME = 'GetMasterCodeName(QString)'

# Input arguments dictionary keys
ARG_request_name = 'sRQName'
ARG_screen_number = 'sScreenNo'
ARG_account = 'sAccNo'
ARG_order_type = 'nOrderType'
ARG_stock_code = 'sCode'
ARG_quantity = 'nQty'
ARG_price = 'nPrice'
ARG_price_type = 'sHogaGb'
ARG_order_number = 'sOrgOrderNo'
LIST_order_args = [ARG_order_type, ARG_stock_code, ARG_quantity, ARG_price, ARG_price_type, ARG_order_number]
LIST_manual_order_input = ['계좌번호', '주문유형', '종목코드', '종목명', '호가구분', '주문가격', '주문수량', '주문번호']

# Order type list
TYPE_buy_new = 1
TYPE_sell_new = 2
TYPE_buy_cancel = 3
TYPE_sell_cancel = 4
TYPE_buy_correct = 5
TYPE_sell_correct = 6
LIST_buy_sell = ['신규매수', '신규매도', '매수취소', '매도취소', '매수정정', '매도정정']
TYPE_price_fixed = '00'
TYPE_price_market = '03'
TYPE_price_fixed_conditional = '05'
TYPE_price_fixed_advantageous = '06'
TYPE_price_fixed_top_priority = '07'

# Transaction codes list
TR_INFO_BASIC = 'opt10001'
TR_INFO_CONTRACT = 'opt10003'
TR_PRICE_CALL = 'opt10004'
TR_ORDERS_CONTRACTS = 'opt10012'
TR_PRICE_DAILY = 'opt10081'
TR_HOLDING_STOCKS = 'opt10085'
TR_ORDER_NOT_CONTRACTED = 'opt10075'
TR_INDEX_DAILY = 'opt20006'
TR_INTERESTS = 'OPTKWFID'
TR_ACC_EVAL = 'OPW00004'
LIST_TR = [TR_INFO_BASIC, TR_INFO_CONTRACT, TR_PRICE_CALL, TR_PRICE_DAILY, TR_INTERESTS, TR_HOLDING_STOCKS, TR_ACC_EVAL,
           TR_ORDER_NOT_CONTRACTED, TR_ORDERS_CONTRACTS, TR_INDEX_DAILY, TR_PRICE_DAILY]

# TR output data dictionary
HD_out_dict_type = 'type'
HD_out_dict_tr = 'tr'
HD_out_dict_account = 'account'
HD_out_dict_code = 'code'
HD_out_dict_rt_code = '종목코드'
HD_out_dict_count = 'count'
HD_out_dict_repeat = 'repeat'
HD_out_dict_data = 'data'
OUTPUT_DICT_TR = [HD_out_dict_tr, HD_out_dict_code, HD_out_dict_count, HD_out_dict_repeat, HD_out_dict_data]
LIST_data_stock = ['종목코드', '종목명', '현재가', '매도호가', '매수호가', '보유수량', '매입가', '매입금액', '당일매도손익',
                   '기준가', '고가', '저가', '전일대비', '등락율', '누적거래량']
LIST_contract_stock = ['종목코드', '종목명', '주문번호', '주문구분', '원주문번호', '주문상태', '주문가격', '주문수량', '미체결수량',
                       '현재가', '매도호가', '매수호가']

# TR input items
TRII_INFO_BASIC = ["종목코드"]
TRII_INFO_CONTRACT = ["종목코드"]
TRII_PRICE_CALL = ["종목코드"]
TRII_PRICE_DAILY = ["종목코드", "기준일자", "수정주가구분"]
TRII_INDEX_DAILY = ["업종코드", "기준일자"]
TRII_HOLDING_STOCKS = ['계좌번호']
TRII_ACC_EVAL = ['계좌번호', '비밀번호', '상장폐지조회구분', '비밀번호입력매체구분']
TRII_ORDERS_CONTRACTS = ['계좌번호']
TRII_ORDER_NOT_CONTRACTED = ['계좌번호', '전체종목구분', '매매구분', '종목코드', '체결구분']

# TR output items
TROI_INFO_BASIC = ["종목코드", "종목명", "결산월", "액면가", "자본금", "상장주식", "신용비율", "연중최고",
                   "연중최저", "시가총액", "시가총액비중", "외인소진률", "대용가", "PER", "EPS", "ROE", "PBR",
                   "EV", "BPS", "매출액", "영업이익", "당기순이익", "250최고", "250최저", "시가", "고가", "저가", "상한가",
                   "하한가", "기준가", "예상체결가", "예상체결수량", "250최고가일", "250최고가대비율", "250최저가일",
                   "250최저가대비율", "현재가", "대비기호", "전일대비", "등락율", "거래량", "거래대비", "액면가단위"]
TROI_INFO_CONTRACT = ["시간", "현재가", "전일대비", "대비율", "우선매도호가단위",
                      "우선매수호가단위", "체결거래량", "sign", "누적거래량", "누적거래대금", "체결강도"]
TROI_PRICE_CALL = ["호가잔량기준시간",
                   "매도10차선잔량대비", "매도10차선잔량", "매도10차선호가",
                   "매도9차선잔량대비", "매도9차선잔량", "매도9차선호가",
                   "매도8차선잔량대비", "매도8차선잔량", "매도8차선호가",
                   "매도7차선잔량대비", "매도7차선잔량", "매도7차선호가",
                   "매도6차선잔량대비", "매도6차선잔량", "매도6차선호가",
                   "매도5차선잔량대비", "매도5차선잔량", "매도5차선호가",
                   "매도4차선잔량대비", "매도4차선잔량", "매도4차선호가",
                   "매도3차선잔량대비", "매도3차선잔량", "매도3차선호가",
                   "매도2차선잔량대비", "매도2차선잔량", "매도2차선호가",
                   "매도1차선잔량대비", "매도최우선잔량", "매도최우선호가",
                   "매수최우선호가", "매수최우선잔량", "매수1차선잔량대비",
                   "매수2차선호가", "매수2차선잔량", "매수2차선잔량대비",
                   "매수3차선호가", "매수3차선잔량", "매수3차선잔량대비",
                   "매수4차선호가", "매수4차선잔량", "매수4차선잔량대비",
                   "매수5차선호가", "매수5차선잔량", "매수5차선잔량대비",
                   "매수6차선호가", "매수6차선잔량", "매수6차선잔량대비",
                   "매수7차선호가", "매수7차선잔량", "매수7차선잔량대비",
                   "매수8차선호가", "매수8차선잔량", "매수8차선잔량대비",
                   "매수9차선호가", "매수9차선잔량", "매수9차선잔량대비",
                   "매수10차선호가", "매수10차선잔량", "매수10차선잔량대비",
                   "총매도잔량직전대비", "총매도잔량", "총매수잔량", "총매수잔량직전대비",
                   "시간외매도잔량", "시간외매수잔량", "시간외매수잔량대비"]
TROI_PRICE_DAILY = ["일자", "시가", "고가", "저가", "현재가", "거래량"]
TROI_INDEX_DAILY = ["일자", "시가", "고가", "저가", "현재가", "거래량"]
TROI_INTERESTS = ['종목코드', '종목명', '현재가', '기준가', '전일대비', '등락율', '거래량', '매도호가', '매수호가',
                  '체결량', '체결강도', '전일거래량대비', '전일대비기호', '거래대금', '매도1차호가', '매도2차호가',
                  '매도3차호가', '매도4차호가', '매도5차호가', '매수1차호가', '매수2차호가', '매수3차호가', '매수4차호가',
                  '매수5차호가', '상한가', '하한가', '시가', '고가', '저가', '종가', '체결시간', '예상체결가', '예상체결량',
                  '자본금', '액면가', '시가총액', '주식수', '호가시간', '일자', '우선매도잔량', '우선매수잔량', '우선매도건수',
                  '우선매수건수', '총매도잔량', '총매수잔량', '총매도건수', '총매수건수', '패리티', '기어링', '손익분기',
                  '자본지지', 'ELW행사가', '전환비율', 'ELW만기일', '미결제약정', '미결제전일대비', '이론가', '내재변동성',
                  '델타', '감마', '쎄타', '베가', '로']
TROI_HOLDING_STOCKS = ['일자', '종목코드', '종목명', '현재가', '매입가', '매입금액', '보유수량',
                       '당일매도손익', '당일매매수수료', '당일매매세금',
                       '신용구분', '대출일', '결제잔고', '청산가능수량', '신용금액', '신용이자', '만기일']
TROI_ACC_EVAL = ['예수금', '유가잔고평가액', '예탁자산평가액', '총매입금액', '추정예탁자산', '매도담보대출금',
                 '당일투자원금', '당월투자원금', '누적투자원금', '당일투자손익', '당월투자손익',
                 '당일손익율', '당월손익율', '누적손익율', '출력건수']
TROI_ACC_EVAL_multi = ['종목코드', '종목명', '보유수량', '평균단가', '현재가', '평가금액', '손익금액', '손익율', '대출일',
                       '매입금액', '결제잔고', '전일매수수량', '전일매도수량', '금일매수수량', '금일매도수량']
TROI_ORDER_NOT_CONTRACTED = ['계좌번호', '주문번호', '관리사번', '종목코드', '업무구분', '주문상태', '종목명', '주문수량',
                             '주문가격', '미체결수량', '체결누계금액', '원주문번호', '주문구분', '매매구분', '시간', 
                             '체결번호', '체결가', '체결량', '현재가', '매도호가', '매수호가', '단위체결가', '단위체결량', 
                             '당일매매수수료', '당일매매세금', '개인투자자']
TROI_ORDERS_CONTRACTS = ['주문수량', '주문가격', '미체결수량', '체결누계금액',
                         '원주문번호', '주문구분', '매매구분', '매도수구분',
                         '주문/체결시간', '체결가', '체결량', '주문상태', '단위체결가',
                         '대출일', '신용구분', '만기일', '보유수량', '매입단가', '총매입가', '주문가능수량',
                         '당일매도수량', '당일매도금액', '당일매수수량', '당일매수금액', '당일매매수수료', '당일매매세금',
                         '당일hts매도수수료', '당일hts매도수수료', '당일매도손익', '당일순매수량', '매도/매수구분',
                         '당일총매도손일', '예수금', '사용가능현금', '사용가능대용', '전일재사용', '당일재사용', 
                         '담보현금', '신용금액', '신용이자', '담보대출수량', '현물주문체결이상유무', '현물잔고이상유무', 
                         '현물예수금이상유무', '선물주문체결이상유무', '선물잔고이상유무', 'D+1추정예수금', 'D+2추정예수금', 
                         'D+1매수/매도정산금', 'D+2매수/매도정산금', 'D+1연체변제소요금', 'D+2연체변제소요금', 
                         'D+1추정인출가능금', 'D+2추정인출가능금', '현금증거금', '대용잔고', '대용증거금', '수표금액', 
                         '현금미수금', '신용설정보증금', '인출가능금액']

# Screen No.
SCR_NORM = '0001'
SCR_STOCK_PRICE_CUR = '0101'
SCR_STOCK_PRICE_DAILY = '0124'
SCR_INDEX_DAILY = '0602'

# Queue parameters
HD_que_task = HD_out_dict_tr
HD_que_param = 'param'
HD_que_repeat = HD_out_dict_repeat
HD_que_target = 'target'
HD_que_type = 'type'
TYPE_task_TR = 'TR'
TYPE_task_order = 'OD'

# Realtime TR list
HD_RT_price = '주식시세'
HD_RT_stock_contract = '주식체결'
HD_RT_call_price = '주식호가잔량'
HD_RT_order_contract = '주문체결'
HD_RT_remaining = '잔고'
HD_RT_call_price_ecn = 'ECN주식호가잔량'
HD_RT_call_price_pri = '주식우선호가'

LIST_RT_type = [HD_RT_price, HD_RT_stock_contract, HD_RT_call_price, HD_RT_call_price_ecn, HD_RT_order_contract,
                HD_RT_remaining, HD_RT_call_price_pri]
LIST_RT_code = [[10, 11, 12, 27, 28, 13, 14, 16, 17, 18, 25, 26, 29, 30, 31, 32, 311, 567, 568],
                [20, 10, 11, 12, 27, 28, 15, 13, 14, 16, 17, 18, 25, 26, 29, 30, 31, 32, 228, 311],
                [21, 41, 61, 81, 51, 71, 91, 42, 62, 82, 52, 72, 92, 43, 63, 83, 53, 73, 93, 44, 64, 84, 54, 74, 94, 45,
                 65, 85, 55, 75, 95, 46, 66, 86, 56, 76, 96, 47, 67, 87, 57, 77, 97, 48, 68, 88, 58, 78, 98, 49, 69, 89,
                 59, 79, 99, 50, 70, 90, 60, 80, 100, 121, 122, 125, 126, 23, 24, 128, 129, 138, 139, 200, 201, 238,
                 291, 292, 293, 294, 295, 621, 631, 622, 632, 623, 633, 624, 634, 625, 635, 626, 636, 627, 637, 628,
                 638, 629, 639, 630, 640, 13, 299, 215, 216],
                [21, 41, 61, 81, 51, 71, 91, 42, 62, 82, 52, 72, 92, 43, 63, 83, 53, 73, 93, 44, 64, 84, 54, 74, 94, 45,
                 65, 85, 55, 75, 95, 46, 66, 86, 56, 76, 96, 47, 67, 87, 57, 77, 97, 48, 68, 88, 58, 78, 98, 49, 69, 89,
                 59, 79, 99, 50, 70, 90, 60, 80, 100, 121, 122, 125, 126, 23, 24, 128, 129, 138, 139, 200, 201, 238,
                 291, 292, 293, 294, 295, 621, 631, 622, 632, 623, 633, 624, 634, 625, 635, 626, 636, 627, 637, 628,
                 638, 629, 639, 630, 640, 13, 299, 215, 216],
                [9201, 9203, 9205, 9001, 912, 913, 302, 900, 901, 902, 903, 904, 905, 906, 907, 908, 909, 910, 911, 10,
                 27, 28, 914, 915, 938, 939, 919, 920, 921, 922, 923],
                [9201, 9001, 917, 916, 302, 10, 930, 931, 932, 933, 945, 946, 950, 951, 27, 28, 307, 8019, 957, 958,
                 918, 990, 991, 992, 993, 959, 924],
                [27, 28]]
RTcode = {10: '현재가', 11: '전일대비', 12: '등락율', 13: "누적거래량", 14: "누적거래대금", 15: "거래량", 16: "시가",
          17: "고가", 18: "저가", 20: "체결시간", 21: "호가시간", 23: "예상체결가", 24: "예상체결수량", 25: "전일대비기호",
          26: "전일거래량대비(계약,주)", 27: '매도호가', 28: "매수호가", 29: "거래대금증감", 30: "전일거래량대비(비율)",
          31: "거래회전율", 32: "거래비용", 41: "매도호가1", 42: "매도호가2", 43: "매도호가3", 44: "매도호가4", 45: "매도호가5",
          46: "매도호가6", 51: "매수호가1", 52: "매수호가2", 53: "매수호가3", 54: "매수호가4", 55: "매수호가5", 56: "매수호가6",
          61: "매도호가수량1", 62: "매도호가수량2", 63: "매도호가수량3", 64: "매도호가수량4", 65: "매도호가수량5",
          66: "매도호가수량6", 71: "매수호가수량1", 72: "매수호가수량2", 73: "매수호가수량3", 74: "매수호가수량4",
          75: "매수호가수량5", 76: "매수호가수량6", 81: "매도호가직전대비1", 82: "매도호가직전대비2", 83: "매도호가직전대비3",
          84: "매도호가직전대비4", 85: "매도호가직전대비5", 86: "매도호가직전대비6", 91: "매수호가직전대비1",
          92: "매수호가직전대비2", 93: "매수호가직전대비3", 94: "매수호가직전대비4", 95: "매수호가직전대비5",
          96: "매수호가직전대비6", 47: "매도호가7", 67: "매도호가수량7", 87: "매도호가직전대비7", 57: "매수호가7",
          77: "매수호가수량7", 97: "매수호가직전대비7", 48: "매도호가8", 68: "매도호가수량8", 88: "매도호가직전대비8",
          58: "매수호가8", 78: "매수호가수량8", 98: "매수호가직전대비8", 49: "매도호가9", 69: "매도호가수량9",
          89: "매도호가직전대비9", 59: "매수호가9", 79: "매수호가수량9", 99: "매수호가직전대비9", 50: "매도호가10",
          70: "매도호가수량10", 90: "매도호가직전대비10", 60: "매수호가10", 80: "매수호가수량10", 100: "매수호가직전대비10",
          121: "매도호가총잔량", 122: "매도호가총잔량직전대비", 125: "매수호가총잔량", 126: "매수호가총잔량직전대비",
          128: "순매수잔량", 129: "매수비율",
          131: "시간외매도호가총잔량", 132: "시간외매도호가총잔량직전대비",
          135: "시간외매수호가총잔량", 136: "시간외매수호가총잔량직전대비",
          138: "순매도잔량", 139: "매도비율", 200: "예상체결가전일종가대비",
          201: "예상체결가전일종가대비등락율", 215: "장운영구분", 216: "투자자별ticker", 228: "체결강도",
          238: "예상체결가전일종가대비기호", 290: "장구분", 291: "예상체결가", 292: "예상체결량", 293: "예상체결가전일대비기호",
          294: "예상체결가전일대비", 295: "예상체결가전일대비등락율", 299: "전일거래량대비예상체결률",
          302: "종목명", 311: "시가총액(억)", 567: "상한가발생시간", 568: "하한가발생시간",
          621: "LP매도호가수량1", 631: "LP매수호가수량1", 622: "LP매도호가수량2", 632: "LP매수호가수량2",
          623: "LP매도호가수량3", 633: "LP매수호가수량3", 624: "LP매도호가수량4", 634: "LP매수호가수량4",
          625: "LP매도호가수량5", 635: "LP매수호가수량5", 626: "LP매도호가수량6", 636: "LP매수호가수량6",
          627: "LP매도호가수량7", 637: "LP매수호가수량7", 628: "LP매도호가수량8", 638: "LP매수호가수량8",
          629: "LP매도호가수량9", 639: "LP매수호가수량9", 630: "LP매도호가수량10", 640: "LP매수호가수량10",
          691: "KO접근도",
          9201: "계좌번호", 9001: "종목코드", 916: "대출일", 917: "신용구분",
          930: "보유수량", 931: "매입단가", 932: "총매입가", 933: "주문가능수량",
          945: "당일순매수량", 946: "매도/매수구분", 950: "당일총매도손익", 951: "예수금",
          307: "기준가", 8019: "손익율", 957: "신용금액", 958: "신용이자", 918: "만기일",
          990: "당일실현손익(유가)", 991: "당일실현손익률(유가)", 992: "당일실현손익(신용)", 993: "당일실현손익률(신용)",
          959: "담보대출수량", 924: "Extra", 9203: "주문번호", 9205: "관리자사번", 912: "주문업무분류", 913: "주문상태",
          900: "주문수량", 901: "주문가격", 902: "미체결수량", 903: "체결누계금액", 904: "원주문번호", 905: "주문구분",
          906: "매매구분", 907: "매도수구분", 908: "주문/체결시간", 909: "체결번호", 910: "체결가", 911: "체결량",
          914: "단위체결가", 915: "단위체결량", 938: "당일매매수수료", 939: "당일매매세금", 919: "거부사유", 920: "화면번호",
          921: "터미널번호", 922: "신용구분(실시간 체결용)", 923: "대출일(실시간 체결용)", 397: "파생상품거래단위",
          305: "상한가", 306: "하한가"}

LIST_data_account = [RTcode[9001], RTcode[302], RTcode[10], RTcode[930], RTcode[931], RTcode[932], RTcode[933],
                     RTcode[945], RTcode[946], RTcode[950], RTcode[951], RTcode[27], RTcode[28], RTcode[307],
                     RTcode[8019], RTcode[397]]
